tests/load/scenarios/device-discovery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  processor: "./processors/device-discovery-processor.js"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Device Discovery Flow"
    weight: 70
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ $processEnvironment.TEST_USERNAME }}"
            password: "{{ $processEnvironment.TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/devices"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.devices[0].id"
              as: "deviceId"
      
      - post:
          url: "/api/discovery/start"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            subnet: "{{ subnet }}"
            protocol: "SSH"
          capture:
            - json: "$.jobId"
              as: "jobId"
      
      - loop:
          - get:
              url: "/api/discovery/status/{{ jobId }}"
              headers:
                Authorization: "Bearer {{ authToken }}"
          - think: 2
        count: 30

  - name: "Device Monitoring"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ $processEnvironment.TEST_USERNAME }}"
            password: "{{ $processEnvironment.TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/devices/{{ randomDeviceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - get:
          url: "/api/monitoring/metrics/{{ randomDeviceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - think: 5

  - name: "Bulk Configuration"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ $processEnvironment.TEST_USERNAME }}"
            password: "{{ $processEnvironment.TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - post:
          url: "/api/config/bulk-update"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            deviceIds: "{{ deviceIdList }}"
            commands: 
              - "/system identity set name=test-{{ $randomString() }}"
          capture:
            - json: "$.taskId"
              as: "taskId"
      
      - loop:
          - get:
              url: "/api/config/task-status/{{ taskId }}"
              headers:
                Authorization: "Bearer {{ authToken }}"
          - think: 3
        count: 20